# ipdebug<a name="ZH-CN_TOPIC_0000001051690317"></a>

## 命令功能<a name="section10191115553720"></a>

ipdebug是控制台命令，是一个调试ipv6信息非常有用的工具，它可以显示IPV6地址前缀，邻居条目信息，目的地缓存条目以及默认的路由条目。

## 命令格式<a name="section124061758123713"></a>

ipdebug

## 使用指南<a name="section171837113810"></a>

输入命令ipdebug。

## 输出说明<a name="section561416467104"></a>

ipdebug打印信息如下：

```
OHOS # ipdebug
=================
|| Prefix List ||
=================
Prefix validLifetime Flags
==============================================================================================
2001:: 86384 1
----------------------------------------------------------------------------------------------
============================
|| Neighbor Cache Entries ||
============================
2001::1 dev eth0 lladr 44:39:C4:94:5D:44 STALE Router
FE80::4639:C4FF:FE94:5D44 dev eth0 lladr 44:39:C4:94:5D:44 REACHABLE Router
--------------------------------------------------------------------
===============================
|| Destination Cache Entries ||
===============================
2001::1 2001::1 pmtu 1500 age 152
FE80::4639:C4FF:FE94:5D44 FE80::4639:C4FF:FE94:5D44 pmtu 1500 age 6
2002::1 FE80::4639:C4FF:FE94:5D44 pmtu 1500 age 17
:: :: pmtu 0 age 219
:: :: pmtu 0 age 219
:: :: pmtu 0 age 219
:: :: pmtu 0 age 219
:: :: pmtu 0 age 219
:: :: pmtu 0 age 219
:: :: pmtu 0 age 219
--------------------------------------------------------------------
============================
|| Default Router Entries ||
============================
FE80::4639:C4FF:FE94:5D44 invalidation_timer 1784 flags 0
--------------------------------------------------------------------
```

